"""
Студент трябва да отиде на изпит в определен час (например в 9:30 часа).
Той идва в изпитната зала в даден час на пристигане (например 9:40).
Счита се, че студентът е дошъл навреме, ако е пристигнал в часа на изпита или до половин час преди това.
Ако е пристигнал по-рано повече от 30 минути, той е подранил. Ако е дошъл след часа на изпита, той е закъснял.
Напишете програма, която прочита време на изпит и време на пристигане и отпечатва дали студентът е дошъл навреме,
дали е подранил или е закъснял и с колко часа или минути е подранил или закъснял.
Вход
От конзолата се четат 4 цели числа (по едно на ред), въведени от потребителя:
Първият ред съдържа час на изпита – цяло число от 0 до 23;
Вторият ред съдържа минута на изпита – цяло число от 0 до 59;
Третият ред съдържа час на пристигане – цяло число от 0 до 23;
Четвъртият ред съдържа минута на пристигане – цяло число от 0 до 59.
Изход
На първия ред отпечатайте:
"Late", ако студентът пристига по-късно от часа на изпита;
"On time", ако студентът пристига точно в часа на изпита или до 30 минути по-рано;
"Early", ако студентът пристига повече от 30 минути преди часа на изпита.
Ако студентът пристига с поне минута разлика от часа на изпита, отпечатайте на следващия ред:
"mm minutes before the start" за идване по-рано с по-малко от час;
"hh:mm hours before the start" за подраняване с 1 час или повече. Минутите винаги печатайте с 2 цифри, например "1:05”;
 "mm minutes after the start" за закъснение под час;
"hh:mm hours after the start" за закъснение от 1 час или повече. Минутите винаги печатайте с 2 цифри, например "1:03”.

"""
#exam time
h_exam = int(input("")) * 60
m_exam = int(input(""))
h_arive = int(input("")) * 60
m_arive = int(input(""))

m_exam_1 = h_exam + m_exam
m_arive_1 = h_arive + m_arive

# --------------------------------------LATE----------------------------------------------------
if m_arive_1 > m_exam_1:
    time = (m_exam_1 - m_arive_1) * -1
    time_h = time // 60
    time_m = time - time_h * 60
    if time <= 59:
        print("Late")
        print(f"{time} minutes after the start")
    elif time_h > 0 and time_m < 10:
        print("Late")
        print(f"{time_h}:0{time_m} hours after the start")
    elif time_h > 0 and time_m > 9:
        print("Late")
        print(f"{time_h}:{time_m} hours after the start")

#--------------------------------------ON TIME __________________________________________________
elif m_exam_1 == m_arive_1:
    print("On time")
elif m_exam_1 - m_arive_1 <= 30:
    time = m_exam_1 - m_arive_1
    print("On Time")
    print(f"{time} minutes before the start")

# ---------------------------------------EARLY----------------------------------------------------------
elif m_exam_1 > m_arive_1:
    time = m_exam_1 - m_arive_1
    time_h = time//60
    time_m = time - time_h*60
    if time <= 59:
        print("Early")
        print(f"{time} minutes before the start")
    elif time_h > 0 and time_m < 10:
        print("Early")
        print(f"{time_h}:0{time_m} hours before the start")
    elif time_h > 0 and time_m > 9:
        print("Early")
        print(f"{time_h}:{time_m} hours before the start")


